Repository: NagVis/nagvis
Catalog: share/frontend/nagvis-js/locale/*/LC_MESSAGES/nagvis.po
Languages: pt_br

# parameterObjName1NotSet
source: The objName1 parameter is missing.
pt_br: O parametro objName1 nao existente.

# automapNotSupportedHere
source: The automap is not supported here.
pt_br: Automap nao suportado aqui.

# parameterTypeNotSet
source: The parameter &quot;type&quot; is missing.
pt_br: O parametro &quot;type&quot; nao existe.

# parameterObjName2NotSet
source: The objName2 parameter is missing.
pt_br: O parametro objName2 nao existe.

# parameterObjTypeNotSet
source: The objType parameter is missing.
pt_br: O parametro objType nao existe.

# parameterObjIdNotSet
source: The parameter &quot;objId&quot; is missing.
pt_br: O parametro &quot;objId&quot; nao existe.

# unknownObject
source: The object of type &quot;[TYPE]&quot; in map &quot;[MAPNAME]&quot; is not allowed.
pt_br: O objeto de tipo &quot;[TYPE]&quot; in map &quot;[MAPNAME]&quot; nao e permitido.

# parameterNameNotSet
source: The parameter &quot;name&quot; is missing.
pt_br: O parametro &quot;name&quot; nao existe.

# parameterUrlNotSet
source: The parameter &quot;url&quot; is missing.
pt_br: O parametro &quot;url&quot; nao existe.

source: Unknown Query
pt_br: Query Desconhecida

# foundNoObjectOfThatTypeOnMap
source: Found no object of that type on the given map.
pt_br: Nenhum objeto encontrado com este tipo no respectivo mapa.

# ObjectNotFoundOnMap
source: The object could not be found on the given map.
pt_br: O objeto nao pode ser encontrado no mapa requerido.

# noBackendDefined
source: No backend could be found in NagVis configuration. You need to define a backend for gathering status information.
pt_br: Nenhum backend encontrado na configuracao do NagVis. Voce precisa definir um backend para obter informacoes de status.

# backendNotExists
source: The backend with ID &quot;[BACKENDID]&quot; of type &quot;[BACKENDTYPE]&quot; does not exist.
pt_br: O backend com o ID &quot;[BACKENDID]&quot; de tipo &quot;[BACKENDTYPE]&quot; nao existe.

# backendNotInitialized
source: The backend with the ID "[BACKENDID]" of type "[BACKENDTYPE]" is not initialized. Maybe there is an undefined backend used in a map?
pt_br: O backend com o ID "[BACKENDID]" de tipo "[BACKENDTYPE]" nao foi inicializada. Talvez exista um backend indefinido em uso no mapa!

# noTablesExists
source: There are no tables in the database matching given prefix &quot;[PREFIX]&quot;. (Backend-ID: [BACKENDID])
pt_br: Nao existe tabela no banco de dados que correponde com o prefixo informado &quot;[PREFIX]&quot;. (Backend-ID: [BACKENDID])

# errorConnectingMySQL
source: Error while connecting to MySQL server. Maybe wrong connection properties in backend? MySQL-Error: [MYSQLERR]. (Backend-ID: [BACKENDID])
pt_br: Erro ao conectar ao servidor MySQL. Talvez as propriedades de conexao do backend estejam erradas! MySQL-Error: [MYSQLERR]. (Backend-ID: [BACKENDID])

# errorSelectingDb
source: Error selecting the database. Maybe wrong database name or insufficient permissions. MySQL-Error: [MYSQLERR]. (Backend-ID: [BACKENDID])
pt_br: Erro ao selecionar o banco de dados. Talvez o nome do banco de dados esteje errado ou as permissoes sejam insuficientes. MySQL-Error: [MYSQLERR]. (Backend-ID: [BACKENDID])

# mysqlNotSupported
source: Your PHP installation lacks SQL support. You can not use the NDOMy Backend without php-mysql. (Backend-ID: [BACKENDID])
pt_br: Falta suporte ao SQL na sua instalacao PHP. Voce nao pode usar o NDMy Backend sem o php-mysql. (Backend-ID: [BACKENDID])

# hostNotFoundInDB
source: The host "[HOST]" could not be found in the database. Maybe it is spelled wrong? (Backend-ID: [BACKENDID])
pt_br: O host "[HOST]" nao pode ser encontrado no banco de dados. Tavelz a escrita esteja errada? (Backend-ID: [BACKENDID])

# hostIsPending
source: The host "[HOST]" is in pending state
pt_br: O host "[HOST]" esta' no estado de pendente

# serviceNotFoundInDB
source: The service "[SERVICE]" on host "[HOST]" could not be found in the database. Maybe it is spelled wrong? (Backend-ID: [BACKENDID])
pt_br: O service "[SERVICE]" no host "[HOST]" nao foi encontrado na base de dados. Tavelz esteja escrito errado! (Backend-ID: [BACKENDID])

# serviceNotChecked
source: The service "[SERVICE]" has not been checked yet
pt_br: O service "[SERVICE]" nao foi verificado ainda

# ndo2fsFileStructureNotValid
source: The file structure in the ndo2fs directory &quot;[PATH]&quot; is not valid. The directory is used by backend with the id &quot;[BACKENDID]&quot;
pt_br: A estrutura de arquivo no diretorio ndo2fs &quot;[PATH]&quot; nao e' valido. O diretorio esta em uso pelo backend com o id &quot;[BACKENDID]&quot;

# nagiosDataNotUpToDate
source: NDO claims that Nagios did no status update for more than &quot;[TIMEWITHOUTUPDATE]&quot; seconds. Make sure that Nagios and NDO daemons are running. (Backend-ID: [BACKENDID])
pt_br: NDO reclama que na acontece mudanca de estado no Nagios por mais de &quot;[TIMEWITHOUTUPDATE]&quot; segundos. Verifique se o Nagios e o daemon NDO estao em execucao. (Backend-ID: [BACKENDID])

# nagiosNotRunning
source: NDO reports that Nagios is not running (Backend-ID: [BACKENDID])
pt_br: NDO reportou que o Nagios nao esta em execucao (Backend-ID: [BACKENDID])

# backendInstanceNameNotValid
source: The given instance name &quot;[NAME]&quot; in backend &quot;[BACKENDID]&quot; is not valid.
pt_br: O nome da instancia informada &quot;[NAME]&quot; no backend &quot;[BACKENDID]&quot; e' invalido.

# backendInstanceNameNotUniq
source: The given instance name &quot;[NAME]&quot; in backend &quot;[BACKENDID]&quot; is not unique.
pt_br: O nome da instancia informada &quot;[NAME]&quot; no backend &quot;[BACKENDID]&quot; nao e' unico.

# backgroundNotExists
source: Map image file "[IMGPATH]" does not exist
pt_br: O arquivo de imagem do mapa "[IMGPATH]" nao existe

# backgroundNotReadable
source: The background image "[IMGPATH]" is not readable.
pt_br: A imagem de fundo "[IMGPATH]" nao pode ser lida.

# backgroundNotWriteable
source: The map image file &quot;[IMGPATH]&quot; is not writeable.
pt_br: O arquivo de imagem do mapa &quot;[IMGPATH]&quot; e' somente leitura.

# backgroundFolderNotWriteable
source: The background image folder &quot;[PATH]&quot; is not writeable.
pt_br: A pasta de imagem do mapa &quot;[PATH]&quot; e' somente leitura.

# gdLibNotFound
source: You told NagVis to use the GD-Libs for drawing lines on the background image (usegdlibs=1). GD-Libs are not installed or loaded in your php.
pt_br: Voce falou ao NagVis para usar o GD-Libs para desenhar linhas e imagens de fundo (usegdlibs=1). GD-Libs nao esta instalado ou nao esta carregado no seu php.

# iconsetFiletypeUnknown
source: Unable do determine the filetype of the iconset &quot;[ICONSET]&quot;. Maybe the &quot;_ok&quot; image is missing?
pt_br: Impossivel determinar o filetype do conjunto de icone &quot;[ICONSET]&quot;. Talves a imagem &quot;_ok&quot; nao exista!

# varFolderNotExists
source: The var folder &quot;[PATH]&quot; does not exist.
pt_br: A pasta var &quot;[PATH]&quot; nao existe.

# varFolderNotWriteable
source: The var folder &quot;[PATH]&quot; is not writeable.
pt_br: A pasta var &quot;[PATH]&quot; e' somente leitura.

# cacheFileNotWriteable
source: The cache file &quot;[FILE]&quot; is not writeable.
pt_br: O arquivo de cache &quot;[FILE]&quot; e' somente leitura.

# fileNotCached
source: The file &quot;[FILE]&quot; is not cached.
pt_br: O arquivo &quot;[FILE]&quot; nao esta em cach.

# cacheFolderNotWriteable
source: The parent folder for the cache file &quot;[FILE]&quot; is not writeable. The cache file can not be created. Please fix the permissions on the filesystem.
pt_br: A pasta pai do arquivo de cache &quot;[FILE]&quot; e' somente leitura. O arquivo de cache nao pode ser criado. Por favor ajuste as permissoes do Sistema de Arquivos.

# cacheFileNotExists
source: The cache file &quot;[FILE]&quot; does not exist.
pt_br: O arquivos de cache &quot;[FILE]&quot; nao existe.

# fileNotExists
source: The file &quot;[FILE]&quot; does not exist.
pt_br: O arquivo &quot;[FILE]&quot; nao existe.

source: Select map
pt_br: Selecionar mapa

# editMap
source: Edit current map
pt_br: Editar mapa atual

source: Need Help?
pt_br: Precisa de ajuda?

# onlineDoc
source: Documentation
pt_br: Documentacao

# forum
source: Support Forum
pt_br: Forum de suporte

# supportInfo
source: NagVis Support Information
pt_br: Informacoes de suporte sobre Nagvis

source: Overview
pt_br: Visao geral

source: Instance
pt_br: Instancia

# rotationStart
source: Start Rotation
pt_br: Iniciar Rotacao

# rotationStop
source: Stop Rotation
pt_br: Parar Rotacao

# refreshStart
source: Start Refresh
pt_br: Iniciar Atualizacao

# refreshStop
source: Stop Refresh
pt_br: Parar Atualizacao

# headerTemplateNotExists
source: The requested header template file &quot;[FILE]&quot; does not exist.
pt_br: O arquivo de modelo de cabecalho &quot;[FILE]&quot; nao existe.

# headerTemplateNotReadable
source: Please check the webservers permissions at the header template file &quot;[FILE]&quot;.
pt_br: Por favor verificar as permissoes do arquivo de modelo de cabecalho no webserver &quot;[FILE]&quot;.

# mapInMaintenance
source: The map you are trying to access is in maintenance mode. Please be patient. This page is reloaded automatically.
pt_br: O mapa que voce tentou acessar esta em modo de manutencao. Por favo seja paciente. This page is reloaded automatically.

source: Map Index
pt_br: Indice de mapas

source: Rotation Pools
pt_br: Pools de Rotacao

# onlyPngOrJpgImages
source: Only PNG or JPG images are allowed for map image files.
pt_br: Somente imagens PNG ou JPG sao permitidos nos arquivos de imagens de mapas.

# imageNotExists
source: An image &quot;[FILE]&quot; which is needed to create a thumbnail image does not exist.
pt_br: A imagem &quot;[FILE]&quot; que e' necessaria para criar uma miniatura de imagem nao existe.

# languageNotFound
source: You configured NagVis to load language &quot;[LANG]&quot;. This language could not be found in language path.
pt_br: Voce configurou o NagVis para carregar a linguagem &quot;[LANG]&quot;. Esta linguagem nao foi encontrada no diretorio de linguagens.

# phpModuleNotLoaded
source: The PHP module &quot;[MODULE]&quot; is not loaded.
pt_br: O modulo PHP &quot;[MODULE]&quot; nao esta carregado.

# mainMustValueNotSet
source: The must value &quot;[ATTRIBUTE]&quot; is not set the section &quot;[TYPE]&quot; in main configuration file.
pt_br: O valor obrigatorio &quot;[ATTRIBUTE]&quot; nao foi definido &quot;[TYPE]&quot; no arquivo principal de configuracao.

# unknownValue
source: The attribute &quot;[ATTRIBUTE]&quot; is not allowed in section &quot;[TYPE]&quot; in main configuration file.
pt_br: O atributo &quot;[ATTRIBUTE]&quot; nao e' permitido na secao &quot;[TYPE]&quot; no arquivo principal de configuracao.

# deprecatedOption
source: The given option &quot;[ATTRIBUTE]&quot; in section &quot;[TYPE]&quot; is deprecated in this version. Please read the documentation/changelog for details.
pt_br: A opcao informada &quot;[ATTRIBUTE]&quot; na secao &quot;[TYPE]&quot; e' obrigatoria nessa versao. Por favor leia a documentacao e o changelog para mais detalhes.

# wrongValueFormat
source: The attribute "[ATTRIBUTE]" in section "[TYPE]" in main configuration file does not match the valid value format
pt_br: O atributo "[ATTRIBUTE]" na secao "[TYPE]" no arquivo de configuracao principal nao coincide com um valor de formato valido

# backendNotDefined
source: The backend with the id &quot;[BACKENDID]&quot; is not defined.
pt_br: O backend com o id &quot;[BACKENDID]&quot; nao foi definido.

# unknownSection
source: The section &quot;[TYPE]&quot; in main configuration file is not allowed.
pt_br: A secao &quot;[TYPE]&quot; no arquivo de configuracao principal nao e' permitida.

# mainCfgNotExists
source: The main configuration file &quot;[MAINCFG]&quot; does not exists.
pt_br: O arquivo de configuracao principal &quot;[MAINCFG]&quot; nao existe.

# mainCfgNotReadable
source: Please check the webservers permissions for the main configuration file &quot;[MAINCFG]&quot;.
pt_br: Por favor verifique a permissao do arquivo de configuracao principal no seu servidor web &quot;[MAINCFG]&quot;.

# mapCfgNotExists
source: The map configuration file "[MAP]" does not exist
pt_br: O arquivo de configuracao do mapa "[MAP]" nao existe

# mapCfgNotReadable
source: The map configuration file &quot;[MAP]&quot; is not readable.
pt_br: O arquivo de configuracao do mapa &quot;[MAP]&quot; nao esta disponivel para leitura.

# mapCfgMustValueNotSet
source: The mandantory option [ATTRIBUTE] is not set in object [TYPE]/[ID] in map [MAPNAME].
pt_br: O valor obrigatorio &quot;[ATTRIBUTE]&quot; nao foi definido no objeto de tipo &quot;[TYPE]&quot; no mapa &quot;[MAPNAME]&quot;.

# unknownAttribute
source: The attribute &quot;[ATTRIBUTE]&quot; is not supported in objects of type &quot;[TYPE]&quot; on map [MAPNAME].
pt_br: O atributo &quot;[ATTRIBUTE]&quot; nao e' suportado em objetos de tipo &quot;[TYPE]&quot; no mapa [MAPNAME].

# mapDeprecatedOption
source: The given option &quot;[ATTRIBUTE]&quot; in section of type &quot;[TYPE]&quot; in map &quot;[MAP]&quot; is deprecated in this version. Please read the documentation/changelog for details.
pt_br: A opcao informada &quot;[ATTRIBUTE]&quot; na secao de tipo &quot;[TYPE]&quot; no mapa &quot;[MAP]&quot; e' obrigatoria nesta versao. Por favor leia a documentacao e changelog para mais detalhes.

# wrongValueFormatMap
source: The attribute "[ATTRIBUTE]" in element of type "[TYPE]" in map configuration file "[MAP]" does not match the valid value format
pt_br: O atributo "[ATTRIBUTE]" no objeto de tipo "[TYPE]" no arquivo de configuracao "[MAP]" nao corresponde um valor de formato valido

# lineTypeButViewTypeNotSet
source: You told NagVis to show an object as line (option line_type set). Since NagVis 1.4 you have to set the option &quot;view_type=line&quot; for line objects. This problem was detected in an object of the type &quot;[TYPE]&quot; on map &quot;[MAP]&quot;.
pt_br: Voce especificou para o NagVis exibir um objeto como linha (option line_type set). Desde o NagVis 1.4 voce precisa definir a opcao &quot;view_type=line&quot; para objetos linha. Este problema foi detectado em um objeto de tipo &quot;[TYPE]&quot; no mapa &quot;[MAP]&quot;.

# viewTypeGadgetButNoGadgetUrl
source: NagVis found an object whitout gadget_url option but view_type=&quot;gadget&quot;. This problem was detected in an object of the type &quot;[TYPE]&quot; on map &quot;[MAP]&quot;.
pt_br: NagVis encontrou um objeto sem a opcao de gadget_url mas view_type=&quot;gadget&quot;. Este problema foi detectado em um objeto de tipo &quot;[TYPE]&quot; no mapa &quot;[MAP]&quot;.

# permissionDenied
source: The user "[USER]" has no permission for this action
pt_br: O usuario "[USER]" nao tem permissao para executar esta acao

# wrongPhpVersion
source: The PHP version you are using &quot;[CURRENT_VERSION]&quot; is too old. NagVis needs PHP &quot;[NEEDED_VERSION]&quot; or newer.
pt_br: A versao do PHP que voce esta usando &quot;[CURRENT_VERSION]&quot; e' muito antido. NagVis precisa do PHP &quot;[NEEDED_VERSION]&quot; ou posterior.

# noUser
source: No user name was handed over to NagVis! For possible solutions please have a look at the FAQ on www.nagvis.org.
pt_br: Nenhum nome de usuario foi passado ao NagVis! Para consultar possiveis solucoes leia o FAQ em www.nagvis.org.

# unknownRenderMode
source: The render mode &quot;[MODE]&quot; is not supported.
pt_br: O modo de renderizacao &quot;[MODE]&quot; nao e' suportado.

# graphvizBinaryNotFound
source: The required graphviz binary &quot;[NAME]&quot; could not be found in the paths: &quot;[PATHS]&quot;.
pt_br: O binario do graphviz &quot;[NAME]&quot; nao pode ser encontrado no caminho: &quot;[PATHS]&quot;.

# couldNotGetRootHostname
source: The Automap needs one root hostname to start the drawing.<br><br> There are three ways to get a root host: URL parameter &quot;root&quot;, Main configuration &quot;automap > default_root&quot;, auto detect (only possible when there is <b>one</b> host with no parent).
pt_br: O automap precisa de um hostname raiz para iniciar o desenho.<br><br> Existem trez modos de obter a raiz de um host: Parametro da URL &quot;root&quot;, Configuracao principal &quot;automap > default_root&quot;, deteccao automatica (Somente possivel quando existe <b>um</b> host com nenhum pai).

# contextConnectBySsh
source: Connect by ssh
pt_br: Conectar por ssh

# contextRefreshStatus
source: Refresh Status
pt_br: Atualizar Estado

# contextRescheduleNextCheck
source: Re-Schedule next Check
pt_br: Re-agendar proxima verificacao

# contextScheduleDowntime
source: Schedule Downtime
pt_br: Agendar Parada

# contextTemplateNotReadable
source: The template is not readable. Please check the webservers permissions on the template file &quot;[FILE]&quot;.
pt_br: O modelo nao pode ser lido. Por favor verifique as permissoes no seu servidor web para o arquivo de modelo &quot;[FILE]&quot;.

# contextTemplateNotExists
source: The template file &quot;[FILE]&quot; does not exist.
pt_br: O arquivo de modelo &quot;[FILE]&quot; nao existe.

source: Address
pt_br: Endereco

source: State
pt_br: Estado

source: Summary State
pt_br: Estado Consolidado

source: Output
pt_br: Saida

source: Perfdata
pt_br: Desempenho

source: Summary Output
pt_br: Saida Consolidada

source: Next Check
pt_br: Proxima Verificacao

source: Last Check
pt_br: Ultima Verificacao

source: State Type
pt_br: Tipo de Estado

source: Current attempt
pt_br: Tentativa Atual

source: Last State Change
pt_br: Ultima Mudanca de Estado

source: State Duration
pt_br: Duracao do Estado

source: Service Name
pt_br: Nome do Servico

source: Notes
pt_br: Notas

# lastStatusRefresh
source: Last state refresh
pt_br: Ultima Atualizacao de Estado

# hoverTemplateNotReadable
source: The hover template is not readable. Please check the webservers permissions for the hover template file &quot;[FILE]&quot;.
pt_br: O modelo de rolagem nao esta acessivel. Por favor verifique as permissoes do seu servidor web para o arquivo de modelo de rolagem &quot;[FILE]&quot;.

# hoverTemplateNotExists
source: The hover template file &quot;[FILE]&quot; does not exist.
pt_br: O arquivo modelo de rolagem &quot;[FILE]&quot; nao existe.

# couldNotGetHoverUrl
source: Could not get hover URL &quot;[URL]&quot;. Maybe the URL is password protected.
pt_br: Impossivel obter a URL de rolagem &quot;[URL]&quot;. Talvez esta URL esteja protegida.

# mapRotationPoolNotExists
source: The given map rotation pool &quot;[ROTATION]&quot; is not defined in NagVis.
pt_br: O mapa informado no pool de rotacao &quot;[ROTATION]&quot; nao esta definido no NagVis.

# problemReadingUrl
source: Unable to open the URL &quot;[URL]&quot;. Error: &quot;[MSG]&quot;
pt_br: Impossivel abrir a URL &quot;[URL]&quot;. Erro: &quot;[MSG]&quot;

source: Objects
pt_br: Objetos

# mapIsEmpty
source: The map "[MAP]" has 0 objects.
pt_br: O mapa "[MAP]" possui 0 objetos.

# noReadPermissions
source: You are not permitted to view the state of this map.
pt_br: Voce nao tem permissao para visualizar o estado deste mapa.

source: Host Name
pt_br: Nome do Host

source: Hostgroup Name
pt_br: Nome do Hostgroup

source: Servicegroup Name
pt_br: Nome do Servicegroup

source: Map Name
pt_br: Nome do Mapa

source: Object Name
pt_br: Nome do Objeto

# childStatesAre
source: There are
pt_br: Existem

# hostStateIs
source: The Host is
pt_br: O Host e'

# hostHasNoServices
source: The host "[HOST]" has no Services.
pt_br: O host "[HOST]" nao possui Services.

# hostGroupNotFoundInDB
source: The hostgroup "[HOSTGROUP]" could not be found in the database. Maybe it is spelled wrong? (Backend-ID: [BACKENDID])
pt_br: O hostgroup "[HOSTGROUP]" nao foi encontrado no banco de dados. Talvez a escrita esteja errada! (Backend-ID: [BACKENDID])

# serviceGroupNotFoundInDB
source: The servicegroup "[SERVICEGROUP]" could not be found in the database. Maybe it is spelled wrong? (Backend-ID: [BACKENDID])
pt_br: O servicegroup "[SERVICEGROUP]" nao foi encontrado no banco de dados. Talvez a escrita esteja errada! (Backend-ID: [BACKENDID])

# validatorNotDefinedParameter
source: Parameter [VAR] is not a defined parameter.
pt_br: O parametro [VAR] nao e' um parametro definido.

# validatorNotSetParameterValue
source: Parameter [VAR] is not set.
pt_br: O parametro [VAR] nao esta definido.

# validatorIsEmptyParameter
source: Parameter [VAR] is empty. Fill this parameter with a (valid) value.
pt_br: O parametro [VAR] esta vazio. Preencha este parametro com um valor valido.

# validatorNotValidBoolean
source: Parameter [VAR] is not a valid boolean (TRUE / FALSE).
pt_br: O parametro [VAR] nao e' um boleano valido (VERDADEIRO / FALSO).

# validatorNotValidInteger
source: Parameter [VAR] contains not a valid integer.
pt_br: O parametro [VAR] contem valor inteiro invalido.

# validatorValueOutOfRange
source: Parameter [VAR] is out of range.
pt_br: O parametro [VAR] esta fora do intervalo.

# validatorNotValidString
source: Parameter [VAR] contains not a valid string.
pt_br: O parametro [VAR] contem uma string invalida.

# ValidatorNotAllowedParameterEntry
source: Parameter [VAR] is not an allowed entry.
pt_br: Informacao nao permitida no parametro [VAR].

# vaidatorNotValidUrl
source: Parameter [VAR] is not a valid URL.
pt_br: URL invalida no parametro [VAR].

# mustValueNotSet
source: A necessary value is not set. All red marked values are compulsory values.
pt_br: O valor requerido "[ATTRIBUTE]" nao foi definido

# methodNotSupportedByBackend
source: The method "[METHOD]" is not supported by the backend.
pt_br: O metodo "[METHOD]" nao e' suportado pelo backend.

# accessModeIsNotValid
source: The access mode "[MODE]" is not valid.
pt_br: O modo de acesso "[MODE]" nao e' valido.

# mapLockNotDeleted
source: The map lock could not be deleted.
pt_br: O lock do mapa nao pode ser excluido.

# unknownAction
source: The action "[ACTION]" is not supported by the ajax handler.
pt_br: A acao "[ACTION]" nao e' suportada pelo manipulador ajax.

source: Save
pt_br: Savar

source: Ascending
pt_br: Ascendente

source: Descending
pt_br: Descrencente

source: Alphabetically
pt_br: Alfabeticamente

# State
source: Status
pt_br: Estados

source: Manual Input...
pt_br: Â» Manual Input...

source: Yes
pt_br: Sim

source: No
pt_br: Nao

source: Set default backend
pt_br: Definir backend padrao

source: Add backend
pt_br: Adicionar backend

source: Edit backend
pt_br: Editar backend

# delBackend
source: Delete backend
pt_br: Remover backend

source: Default backend
pt_br: Backend padrao

# couldNotDeleteMapImage
source: Could not delete the map image file &quot;[IMGPATH]&quot;.
pt_br: Nao foi possivel excluir o arquivo de imagem de mapa &quot;[IMGPATH]&quot;.

# moveUploadedFileFailed
source: Could not move the uploaded file to the shape directory "[PATH]".
pt_br: Nao foi possivel mover o arquivo enviado para o diretorio de formas "[PATH]".

# mustChooseValidImageFormat
source: You have to select an image in a supported format (Png, Gif, Jpg).
pt_br: Voce tem que selecionar uma imagem com um formato suportado (Png, Gif, Jpg).

# fileCouldNotBeUploaded
source: The file could not be uploaded to the webserver.
pt_br: O arqvuio nao pode ser enviado para o servidor.

# imageAlreadyExists
source: The image "[MAPNAME]" already exists. Rename the file.
pt_br: A imagem "[MAPNAME]" ja' existe. Renomear o arquivo.

# createBackground
source: Create background image
pt_br: Criar uma imagem de fundo

source: Create
pt_br: Criar

# uploadBackground
source: Upload background image
pt_br: Enviar imagem de fundo

source: Upload
pt_br: Enviar

# deleteBackground
source: Delete background image
pt_br: Remover uma imagem de fundo

source: Delete
pt_br: Remover

# chooseImage
source: Choose an image
pt_br: Escolha uma imagem
