Repository: NagVis/nagvis
Catalog: share/frontend/nagvis-js/locale/*/LC_MESSAGES/nagvis.po
Languages: pt_br

# backgroundName
source: Name
pt_br: Nome

# backgroundColor
source: Color (Hex)
pt_br: Cor (Hex)

# backgroundWidth
source: Width (px)
pt_br: Largura (px)

# backgroundHeight
source: Height (px)
pt_br: Altura (px)

source: Default value
pt_br: Valor padrao

# disabled
source: Deactivated
pt_br: Desativado

# mainCfgNotWriteable
source: The main configuration file is not writeable.
pt_br: O principal arquivo de configuracao e' somente leitura.

# mainCfgCouldNotWriteMainConfigFile
source: The main configuration file cache is not writeable.
pt_br: O principal arquivo de cache de configuracao e' somente leitura.

# mapCfgDirNotWriteable
source: Please check the webservers permissions for the map configuration folder &quot;[MAPPATH]&quot;.
pt_br: Por favor verifique as permissoes do webserver na seguinte pasta de configuracao dos mapas &quot;[MAPPATH]&quot;.

# iconNotExists
source: An icon &quot;[IMGPATH]&quot; which is used on the map does not exist.
pt_br: O icone &quot;[IMGPATH]&quot; que e usado no mapa nao existe.

# change
source: Modify
pt_br: Modificar

source: Position/Size
pt_br: Posicao/Tamanho

source: Configured
pt_br: Configurado

source: Inherited
pt_br: Heranca

source: Restore
pt_br: Restaurar

# properties
source: Options
pt_br: Opcoes

source: Add object
pt_br: Adicionar objeto

# nagVisConfig
source: NagVis configuration
pt_br: Configuracao NagVis

source: Help
pt_br: Ajuda

# open
source: Open map
pt_br: Abrir mapa

source: Open in NagVis
pt_br: Abrir no Nagvis

# manageMaps
source: Maps
pt_br: Mapas

# manageBackgrounds
source: Backgrounds
pt_br: Fundos

# manageShapes
source: Shapes
pt_br: Forma

source: Icon
pt_br: Icone

source: Line
pt_br: Linha

source: Special
pt_br: Especial

source: Map
pt_br: Mapa

source: Textbox
pt_br: Caixa de texto

source: Shape
pt_br: Forma

source: Manage
pt_br: Gerenciar

# clickMapToSetPoints
source: Click on the map to determine the position of the missing points.
pt_br: Clicar no mapa para determinar a posicao dos pontos perdidos.

# confirmDelete
source: Do you really want to delete this object?
pt_br: Voce realmente deseja excluir este objeto?

# confirmRestore
source: Are you sure that you want to restore the backup?
pt_br: Voce tem certeza que desenha restaurar o backup?

# wrongValueFormatOption
source: The attribute "[ATTRIBUTE]" does not match the valid value format
pt_br: O atributo "[ATTRIBUTE]" nao coincide com um valor de formato valido

# unableToWorkWithMap
source: The map changes can not be processed anymore. Procedure was terminated.
pt_br: Alteracao do mapa nao pode processeguir. O procedimento terminou.

# chosenLineTypeNotValid
source: The selected line_type is invalid.
pt_br: O tipo de linha selecionada nao e valida.

# onlyLineOrIcon
source: An object can only be an icon or a line, "iconset" and "line_type" can be used not together.
pt_br: Um objeto pode ser somente um icone ou uma linha, "iconset" e "line_type" pode nao pode ser usados juntos.

# not2coords
source: It seems that you want to define a line ("line_type" is set) but you didn&quot;t give two "[COORD]" coordinates.
pt_br: Parece que tentou definir a linha ("line_type" is set) mas nao informou duas but coordenadas "[COORD]" .

# only1or2coords
source: Only one or two [COORD] coordinates can be defined.
pt_br: Somente uma ou duas [COORD] coordenadas podem ser definidas.

# lineTypeNotSet
source: The option &quot;line_type&quot; is not set.
pt_br: A opecao &quot;line_type&quot; nao foi definida.

# mapObjectWillShowSummaryState
source: This map object will show the summary state of the map and its children.
pt_br: Este objeto do mapa mostrara um sumario de status do mapa e seus mapas filho.

# firstMustChoosePngImage
source: Please choose an image in PNG-Format.
pt_br: Por favor escolha uma imagem no formato PNG.

# foundNoBackgroundToDelete
source: No background image found. Operation terminated.
pt_br: Nenhuma imagem de fundo encontrada. Operacao encerrada.

# confirmBackgroundDeletion
source: Do you really want to delete this background image? This action cannot be reverted.
pt_br: Voce realmente deseja excluir esta imagem de fundo? Esta acao nao pode ser revertida.

# mustValueNotSet1
source: The required value "[ATTRIBUTE]" is not set
pt_br: O valor requerido "[ATTRIBUTE]" nao foi definido

# foundNoShapeToDelete
source: No shape image found. Operation terminated.
pt_br: Nenhuma imagem de forma encontrada. Operacao encerrada.

# shapeInUse
source: The shape is in use on the map "[MAP]".
pt_br: A forma esta em uso no mapa "[MAP]".

# confirmShapeDeletion
source: Do you really want to delete this shape image? This action cannot be reverted.
pt_br: Voce realmente deseja excluir esta forma? Esta acao nao pode ser revertida.

# unableToDeleteShape
source: Cannot delete shape "[IMAGENAME]" because it is used by map "[MAP]".
pt_br: Impossivel excluir a forma "[IMAGENAME]" pois esta em uso pelo mapa "[MAP]".

# chooseMapName
source: You have to insert a name for the new map.
pt_br: Voce precisa inserir um nome para o novo mapa.

# minOneUserAccess
source: At least one user must have access to the map.
pt_br: Pelo menos um usuario precisa ter acesso ao mapa.

# noMapToRename
source: No map found. Operation terminated.
pt_br: Nenhum mapa encontrado. Operacao encenrrada.

# noNewNameGiven
source: You specified no new names.
pt_br: Voce nao especificou um novo nome.

# mapAlreadyExists
source: The map "[MAPNAME]" already exists. Rename the file.
pt_br: O mapa "[MAPNAME]" ja existe. Renomear o arquivo.

# foundNoMapToDelete
source: No map found. Operation terminated.
pt_br: Mapa nao encontrado. Operacao encerrada.

# foundNoMapToExport
source: No map found. Select a map to export.
pt_br: Nenhum mapa encontrado. Selecione um mapa para exportar.

# foundNoMapToImport
source: There is no file given to import. Select a file to import.
pt_br: Nenhum arqvuio para importar. Selecione um arquivo para importar.

# notCfgFile
source: The given file has not the extension ".cfg". Rename the file.
pt_br: O arquivo informado nao tem a extensao ".cfg". Renomeie o arquivo.

# confirmNewMap
source: Do you really want to create a new map?
pt_br: Voce realmente deseja criar um novo mapa?

# confirmMapRename
source: Do you really want to rename this map?
pt_br: Voce realmente deseja renomear este mapa?

# confirmMapDeletion
source: Do you really want to delete this map? This action can not be reverted.
pt_br: Voce realmente deseja excluir este mapa? Esta acao nao pode ser revertida.

# unableToDeleteMap
source: Unable to delete map "[MAP]". The map is included in another map "[PARENTMAP]".
pt_br: Impossivel excluir o mapa "[MAP]", pois este mapa esta incluido no mapa "[PARENTMAP]".

# noPermissions
source: You do not have the permissions to change this map.
pt_br: Voce nao tem permissao para alterar este mapa.

# minOneUserWriteAccess
source: At least one user must have the authorization in order to change this map.
pt_br: Pelo menos um usuario precisa de autorizacao para alterar este mapa.

# noSpaceAllowed
source: Blanks are not allowed.
pt_br: Espacos em branco nao sao permitidos.

# couldNotDeleteMapCfg
source: Could not delete the map configuration file &quot;[MAPPATH]&quot;.
pt_br: Arquivo de configuracao do mapa NAO deletado &quot;[MAPPATH]&quot;.

# mapCfgNotWriteable
source: The map configuration file is not writeable.
pt_br: O arquivo de configuracao do mapa e somente leitura.

# mapLocked
source: The map "[MAP]" is locked by user "[USER]" from IP "[IP]" since [TIME]. Edit anyway? (Override lock?)
pt_br: O mapa "[MAP]" esta bloqueado pelo usuario "[USER]" no IP "[IP]" desde [TIME]. Editar mesmo assim? (Sobrescrever lock?)

# mapLockNotExists
source: The lockfile &quot;[MAP]&quot; does not exist.
pt_br: O arquivo de lock &quot;[MAP]&quot; nao existe.

# mapLockNotReadable
source: The lockfile &quot;[MAP]&quot; is not readable.
pt_br: O arquivo de lock &quot;[MAP]&quot; nao pode ser lido.

# mapLockNotWriteable
source: The lockfile &quot;[MAP]&quot; is not writeable.
pt_br: O arquivo de lock &quot;[MAP]&quot; e somente leitura.

source: Create map
pt_br: Criar mapa

source: Rename map
pt_br: Renomear mapa

source: Rename
pt_br: Renomear

source: Delete map
pt_br: Deletar mapa

source: Export map
pt_br: Exportar mapa

source: Export
pt_br: Exportar

source: Import map
pt_br: Importar mapa

source: Import
pt_br: Importar

# chooseMap
source: Select map
pt_br: Selecionar mapa

# chooseMapFile
source: Select a map configuration file
pt_br: Selecionar um arquivo de configuracao de mapa

# newMapName
source: New name
pt_br: Novo nome

source: Map name
pt_br: Nome do mapa

# readUsers
source: User with read permissions
pt_br: Usuario com premissao de leitura

# writeUsers
source: User with write permissions
pt_br: Usuario com permissao de escrita

source: Map Iconset
pt_br: Conjunto de icones de mapa

source: Background
pt_br: Fundo

source: Upload shape
pt_br: Enviar forma

source: Delete shape
pt_br: Deletar forma

# choosePngImage
source: Select a PNG/GIF/JPG image
pt_br: Selecione uma imagem PNG

# failedToDeleteShape
source: Cannot delete shape "[IMAGE]".
pt_br: Impossivel excluir a forma "[IMAGE]".

# shapeDoesNotExist
source: The shape "[IMAGE]" does not exist.
pt_br: A forma "[IMAGE]" na existe.

# mustBePngFile
source: The file has the wrong file extension (has to be *.png)
pt_br: Arquivo com extensao errada (precisa ser *.png)

# uploadFailed
source: Upload not possible. There are some problems with your webserver configuration.
pt_br: Impossivel atualizar. Existem problemas com a configuracao do seu webserver.
