<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
    <head>
        <title>nagvis_automap</title>
        <link rel="stylesheet" type="text/css" media="screen" href="../general/css/style.css" />
<!--[if IE]>
        <style type="text/css">
            /* place css fixes for all versions of IE in this conditional comment */
            .page #sidebar1, .page #sidebar2 { padding-top: 30px; }
            .page #mainContent { zoom: 1; padding-top: 15px; }
            /* the above proprietary zoom property gives IE the hasLayout it needs to avoid several bugs */
        </style>
<![endif]-->
    </head>
    <h1>Automap</h1>
    <h2>Einleitung</h2>
    Die NagVis-Automap wurde mit NagVis-1.3 eingef&uuml;hrt.
    Die Hauptaufgabe dieses Features ist der Ersatz der eingebauten Map von Nagios.
    Das gr&ouml;&szlig;te Problem der Nagios-Map ist die fehlende Skalierbarkeit.
    In gro&szlig;en Nagios-Installationen ist die Automap nicht nutzbar.
    Das liegt u.a. an fehlenden Konfigurationsoptionen wie z.B. der Selektion von bestimmten anzuzeigenden Elementen. 
    <br>
    <br>
    NagVis behandelt die Objekte und definiert eine Konfiguration f&uuml;r <a href="http://www.graphviz.org/">Graphviz</a>.
    Das Map-Bild und der HTML-Code f&uuml;r die Links werden von GraphViz erzeugt und an NagVis weitergeleitet.
    <br>
    <h2>Voraussetzungen</h2>
    <ul>
        <li><a href="http://www.graphviz.org">GraphViz</a> &gt;= 2.14 f&uuml;r die Automap (niedrigere Versionen haben Probleme mit Truecolor-Unterst&uuml;tzung beim Rendering).
        Sie ben&ouml;tigen weitere Pakete wie gd, libpng und freetype, ... aber wenn Sie graphviz kompiliert/installiert haben, sollte es funktionieren.
        </li>
        <li>
        Sie m&uuml;ssen Abh&auml;ngigkeiten zwischen den einzelnen Hosts definieren. Hinweise finden Sie u.a. <a href="http://www.nagios-wiki.de/nagios/doku3/networkreachability">hier</a>.
        </li>
    </ul>

    <h2>Erster Aufruf</h2>
    Wenn Sie bisher keine Erfahrung mit der Automap haben, dann werfen Sie einen Blick auf die Demo-Automaps, die mit NagVis installiert
    werden (demo-automap und demo-automap2). Sie sollten in der Lage sein, diese Automaps direkt nach der NagVis-Installation &uuml;ber das
    &quot;&Ouml;ffnen&quot;-Men&uuml; in der Kopfzeile zu &ouml;ffnen.
    Wenn alles korrekt konfiguriert ist, sollten auf der Demonstrations-Map &quot;demo-automap&quot; der root-Host und drei Ebenen von
    Kind-Hosts angezeigt werden.
    <br>
    <h2>Map-Konfiguration</h2>
    In der Vergangenheit wurden die Automaps durch spezielle Map-Konfigurationsdateien konfiguriert, die im Verzeichnis
    <code>etc/automaps</code> abgelegt waren, aber dies wurde mit NagVis 1.7 ge&auml;ndert. Die Automap-Konfigurationsdateien werden nun
    wie normale Map-Konfigurationen erzeugt (wie in <a href="map_config_format_description">Map-Konfigurationsdatei</a> beschrieben.
    Um ab NagVis 1.7 eine Automap zu erzeugen, m&uuml;ssen Sie die Map-Source auf <code>automap</code> setzen. Um dies zu tun, m&uuml;ssen
    Sie im global-Abschnitt den <code>sources</code>-Parameter einf&uuml;gen und ihm den Wert <code>automap</code> geben.
    <br>
    <h2>Hauptkonfiguration</h2>
    Einige Parameter f&uuml;r die Automap k&ouml;nnen in der Hauptkonfiguration von NagVis gesetzt werden.
    Weitere Informationen finden Sie in der <a href=./nagvis_config_format_description.html>Beschreibung der Hauptkonfigurationsdatei</a>.
    <br>
    <h2>URL-Parameter</h2>
    Die Automap kann mit verschiedenen URL-Parametern aufgerufen werden. Seit NagVis 1.7 k&ouml;nnen diese Optionen in den global-Abschnitt
    der Map-Konfiguration eingetragen werden, damit sie persistent sind. Hier eine Liste aller verf&uuml;gbarer Optionen:<br>
    <table border=0>
        <tr>
            <th> Parameter </th><th> Default </th><th> Beschreibung </th>
        </tr> 
        <tr>
            <td> show </td><td> </td><td> Der Name der Automap. Seit NagVis 1.5 k&ouml;nnen verschiedene Automap-Konfigurationsdateien definiert werden. Die anzuzeigende Automap muss hier angegeben werden.</td>
        </tr>
        <tr>
            <td> backend_id<strike> backend </strike></td><td> default backend </td><td> Die Backend-Id des Backends, dessen Objekte benutzt werden sollen. Einzelheiten
            finden Sie im [backend_*]-Abschnitt der <a href=./nagvis_config_format_description.html>Beschreibung der Hauptkonfigurationsdatei</a>.</td>
        </tr>
        <tr>
            <td> root </td><td> siehe <a href="#root/object/definition">root object definition</a></td><td>Dies ist der Name des Root-Objektes. Es ist nicht notwendig, den Host hier zu setzen. Es gibt mehrere Wege, das Root-Objekt zu ermitteln. Einzelheiten finden Sie im <a href=#Root-Objekt-Definition>Root-Objekt-Definition</a>-Kapitel auf dieser Seite</td>
        </tr>
        <tr>
            <td> child_layers<strike> childLayers </strike></td><td> 2 </td><td> maximale Anzahl von anzuzeigenden Ebenen abh&auml;ngiger "Child"-Hosts.</td>
        </tr>
        <tr>
            <td> parent_layers<strike> parentLayers </strike></td><td> 0 </td><td> maximale Anzahl von anzuzeigenden Ebenen dar&uuml;ber liegender "Parent"-Hosts.</td>
        </tr>
        <tr>
            <td> render_mode<strike> renderMode </strike></td><td> undirected </td><td> Setzt den Render-Modus der Map. Einzelheiten finden Sie unter <a href=#available/render/modes>verf&uuml;gbare Render-Modi</a> </td>
        </tr>
        <tr>
            <td> width </td><td> 1024 </td><td> Breite der Automap in Pixeln </td>
        </tr>
        <tr>
            <td> height </td><td> 786 </td><td> H&ouml;he der Automap in Pixeln</td>
        </tr>
        <tr>
            <td> ignore_hosts<strike> ignoreHosts </strike></td><td> none </td><td> Kommaseparierte Liste von Hosts (einschlie&szlig;lich abh&auml;ngiger Hosts), die nicht angezeigt werden sollen</td>
        </tr>
        <tr>
            <td> filter_by_state<strike> filterByState </strike></td><td> none </td><td> Bei einem Wert von 1 ist der "Problem Automap"-Modus aktiviert. Dabei werden alle Zweige ausgefiltert, die nur Hosts im Status "UP" enthalten. Das resultiert in einer "Problem-Automap", die einen Baum zeigt, in dem in jedem Zweig mindestens einen Host mit einem Problem gibt</td>
        </tr>
        <tr>
            <td> filter_by_id </td><td></td><td> Die angegebenen object_ids ausschlie&szlig;en; wird haupts&auml;chlich intern genutzt
            <font color="red">(neu in 1.7)</font>.</td>
        </tr>
        <tr>
            <td> filter_group<strike> filterGroup </strike></td><td> none </td><td> Geben Sie den Namen einer Hostgruppe an. Nur Hosts dieser Hostgruppe werden auf der Map angezeigt.</td>
        </tr>
        <tr>
            <td> search </td><td> none </td><td> Suche nach einem Map-Objekt w&auml;hrend des Map-Ladens. Passende Objekte werden hervorgehoben.</td>
        </tr>
        <tr>
            <td> rankdir </td>LR<td> none </td><td> Konfiguriert die Richtung von gerichteten Automaps, kann auf TB (Top/Bottom) oder LR (Links/Rechts) gesetzt werden <font color="red">(neu in 1.7)</font>.</td>
        </tr>
        <tr>
            <td> rotation </td><td> none </td><td> Rotieren der Map-Objekte im angegebenen Rotations-Pool</td>
        </tr>
        <tr>
            <td> header_menu<strike> enableHeader </strike></td><td> none </td><td> Aktivieren/Deaktivieren des Header-Men&uuml;s durch 1 bzw. 0. &Uuml;bersteuert die Konfiguration.</td>
        </tr>
        <tr>
            <td> hover_menu<strike> enableHover </strike></td><td> none </td><td> Aktivieren/Deaktivieren des Hover-Men&uuml;s durch 1 bzw. 0. &Uuml;bersteuert die Konfiguration.</td>
        </tr>
        <tr>
            <td> context_menu<strike> enableContext </strike></td><td> none </td><td> Aktivieren/Deaktivieren des Context-Men&uuml;s durch 1 bzw. 0. &Uuml;bersteuert die Konfiguration.</td>
        </tr>
        <tr>
            <td> margin </strike></td><td> none </td><td> Setzt den freien Bereich am Rand des Automap-Graphen.
            Die Angabe erfolgt in Pixeln.</td>
        </tr>
        <tr>
            <td> overlap </strike></td><td> none </td><td> Konfigurieren der Kollisionsbehandlung von Objekten (eine Erkl&auml;rung der
            Werte finden Sie in der GraphViz-Dokumentation) (<font color="red">(neu in 1.7)</font></td>
        </tr>
    </table>
    <a name=root/object/definition></a> 
    <h2>Root-Objekt-Definition</h2> 
    Die Vorgehensweise der Automap ist, beim Root-Objekt zu beginnen und den in Nagios definierten Abh&auml;ngigkeitsbaum zu durchlaufen und die gefundenen Objekte auf der Map anzuzeigen.
    <br>
    Es gibt mehrere Wege, um das Root-Objekt zu ermitteln:
    <ul>
        <li> URL-Parameter: das Root-Objekt kann durch den Parameter <code>root</code> gesetzt werden<br></li>
        <li> Hauptkonfiguration: die <code>defaultroot</code>-Option kann im <code>[automap]</code>-Abschnitt gesetzt werden<br></li>
        <li> automatische Erkennung: Das Backend nach einem Host ohne Eltern fragen. Das funktioniert allerdings nur, wenn es genau EINEN Host ohne Eltern gibt.<br></li>
    </ul>
    Die obige Liste ist nach Priorit&auml;t geordnet.
    <br>
    <a name=available/render/modes></a>
    <h2>Verf&uuml;gbare Render-Modi</h2>
    Es gibt verschiedene verf&uuml;gbare Render-Modi: <br>
    <table border=0>
        <tr>
            <td> Modus </td><td> Beispiel-Bild </td>
        </tr>
        <tr>
            <td valign="top"> directed </td>
            <td align="center"><img alt="" src="../general/img/nagvis-1.3-automap-directed-1-thumb.png" /></td>
        </tr>
        <tr>
            <td valign="top"> undirected </td>
            <td align="center"><img alt="" src="../general/img/nagvis-1.3-automap_undirected-1-thumb.png" /></td>
        </tr>
        <tr>
            <td> radial </td><td> </td>
        </tr>
        <tr>
            <td> circular </td><td> </td>
        </tr>
        <tr>
            <td> undirected2 </td><td> </td>
        </tr>
    </table>
    <a name=automap_export></a>
    <h2>Automap-nach-Map-Export</h2>
    <p>Seit NagVis 1.5 ist es m&ouml;glich, die aktuelle Automap-Ansicht als normale NagVis-Map zu exportieren.
        Durch den Export erhalten Sie Vorteile aus beiden Ansichten.</p>
    
    <p>Sie k&ouml;nnen mit der Automap beginnen, um mit Hilfe der Automap-Render-Modi die Objekte auf Ihrer Automap zu positionieren.
        Sobald Sie fertig sind, exportieren Sie die Automap zusammen mit dem generierten Hintergrundbild in eine regul&auml;re Map.
        Dazu benutzen Sie den Punkt "Export to map", den Sie im "Aktionen"-Men&uuml; Ihres Header-Men&uuml;s finden.</p>

    <p>Auf der exportierten Map k&ouml;nnen Sie - abh&auml;ngig von Ihren Anforderungen - zus&auml;tzliche Design-Elemente platzieren oder das Layout anpassen.</p>

    <p>Eine Automap kann beliebig oft in die gleiche Ziel-Map exportiert werden (wodurch nat&uuml;rlich Ihre Anpassungen in der Ziel-Map &uuml;berschrieben werden!).
        Sie k&ouml;nnen nur Maps &uuml;berschreiben, wenn Sie die Berechtigung dazu haben.</p>

    <p>Eine normale Map kann nicht in eine Automap konvertiert werden.</p>

    <h2>Host-URLs</h2>
    <p>Die URLs von Host-Objekten werden zur Identifizierung der Objekte w&auml;hrend des Renderns benutzt.
        Speziell der &quot;host=&quot;-Parameter ist wichtig.
        Wenn dieser Parameter in der Host-URL fehlt, dann k&ouml;nnen die Objektpositionen nicht ermittelt werden.</p>
    <p>Normalerweise sollte diese Information nicht von Interesse f&uuml;r Sie sein.
        Wenn Sie aber die Host-URLs in Ihrer NagVis-Installation anpassen, dann ist es wichtig zu wissen, dass Ihre benutzerdefinierte URL den Parameter &quot;host=&quot; enthalten muss, der mit dem Hostnamen des Objekts zu f&uuml;llen ist, damit die Hosts in der Automap benutzt werden k&ouml;nnen.</p>

</html>
