<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
    <head>
        <title>nagvis_config_format_description</title>
        <link rel="stylesheet" type="text/css" media="screen" href="../general/css/style.css" />
    <!--[if IE]>
        <style type="text/css"> 
            /* place css fixes for all versions of IE in this conditional comment */
            .page #sidebar1, .page #sidebar2 { padding-top: 30px; }
            .page #mainContent { zoom: 1; padding-top: 15px; }
            /* the above proprietary zoom property gives IE the hasLayout it needs to avoid several bugs */
        </style>
<![endif]-->
    </head>  
    <h1>Formatbeschreibung der Hauptkonfigurationsdatei </h1>
    <h2>Allgemeine Informationen</h2>
    <a name="Allgemeine Informationen"></a>
    Die Hauptkonfigurationsdatei ist im reinen Textformat im Stil der "ini"-Dateien. <br>
    Abschnitte sind durch [] markiert und Variablen haben einen zugewiesenen Wert.
    Die Variablen m&uuml;ssen auch im richtigen Abschnitt stehen, so dass Sie sicherstellen m&uuml;ssen, dass ggf. auch der Abschnitt aktiviert ist. <br>
    Semikola (<code>;</code>) werden benutzt, um Kommentare zu markieren.
    Abschnitte und Variablen mit einem vorangestellten Semikolon werden als Kommentare angesehen und von NagVis nicht erkannt. </p>
    Bei einer neuen NagVis-Installation gibt es keine Datei mit einer Default-Konfiguration.
    Standardwerte sind im PHP-Code enthalten.
    Konfigurationseinstellungen in der Datei <code>etc/nagvis.ini.php</code> &uuml;bersteuern diese Standardwerte. <br>
    Es gibt eine Datei <code>etc/nagvis.ini.php-sample</code> mit Beispiel-Konfigurationswerten. Alle Werte sind auskommentiert. <br>
    
    <a name="Ueberblick"></a>
    <h2>&Uuml;berblick</h2>
    
    <ul>
        <li><a href=#global>global</a>
            <br>allgemeine Optionen, die die gesamte NagVis-Installation beeinflussen
        </li>
        <li><a href=#paths>paths</a>
            <br>Pfaddefinitionen
        </li>
        <li><a href=#defaults>defaults</a>
            <br>Standardwerte, die an die Maps und ihre Objekte vererbt werden
        </li>
        <li><a href=#index>index</a>
            <br>Optionen, um die &Uuml;bersichtsseite f&uuml;r NagVis zu konfigurieren
        </li>
        <li><a href=#automap>automap</a>
            <br>Optionen f&uuml;r die Automap
        </li>
        <li><a href=#wui>wui</a>
            <br>Optionen f&uuml;r die WUI
        </li>
        <li><a href=#worker>worker</a>
            <br>Optionen f&uuml;r den Worker</li>
        </li>
        <li><a href=#backend>backend_*</a>
            <br>Backend-Definitionen
        </li>
        <li><a href=#rotation>rotation_*</a>
            <br>Rotationspool-Definitionen
        </li>
        <li><a href=#states>states</a>
            <br>Optionen, die die Behandlung und das Aussehen der verschiedenen Zust&auml;nde beeinflussen
        </li>
    </ul>        
    
    <h2>Beschreibung der Abschnitte im Detail</h2>
    
    <a name=global></a>
    <h3>global</h3>
    Alle Werte, die f&uuml;r das gesamte NagVis gelten, werden im global-Abschnitt gespeichert. 
    <!--Dieses Beispiel zeigt alle Werte des global-Abschnittes: <br>
    <pre>[global] 
    language="english"
    displayheader=1
    refreshtime=60
    dateformat="Y-m-d H:i:s"</pre> 
    --> 
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>audit_log</td><td>0</td><td>Aktivieren/deaktiviern der Protokollierung von sicherheitsrelevanten Benutzeraktionen in NagVis. Benutzeran- und abmeldungen werden z.B. in var/nagvis-audit.log protokolliert.</td>
        </tr>
        <tr>
            <td>authmodule</td><td>CoreAuthModSQLite</td><td>Definiert das zu benutzende Authentifizierungsmodul. Per Default benutzt NagVis das eingebaute SQLite-Authentifizierungsmodul. Bei der Auslieferung ist kein anderes Authentifizierungsmodul verf&uuml;gbar. Es ist m&ouml;glich, andere Authentifizierungsmodule hinzuzuf&uuml;gen, um andere Authentifizierungsmechanismen zu unterst&uuml;tzen. Weitere Einzelheiten finden Sie in der <a href="auth_modules">Authentifizierungsmodul</a>-Dokumentation</td><td> 
        </tr>
        <tr>
            <td>authorisationmodule</td><td>CoreAuthorisationModSQLite</td><td>Definiert das zu benutzende Autorisierungsmodul. Per Default benutzt NagVis das eingebaute SQLite-Autorisierungsmodul. Bei der Auslieferung ist kein anderes Autorisierungsmodul verf&uuml;gbar. Es ist m&ouml;glich, andere Autorisierungsmodule hinzuzuf&uuml;gen, um andere Autorisierungsmechanismen zu unterst&uuml;tzen. Weitere Einzelheiten finden Sie in der <a href="authorisation_modules">Autorisierungsmodul</a>-Dokumentation</td><td> 
        </tr>
        <tr>
          <td>controls_size <font color="#ff0000">(neu in 1.6)</font></td>
          <td>10</td>
          <td>Die Gr&ouml;&szlig;e (in Pixeln) von Objekt-Kontrollelementen in entsperrten (Edit)-Modus im Frontend.
              Objekt-Kontrollelemente sind z.B. die "modify"-, "delete"- und "move"-Icons.</td>
        </tr>
        <tr>
            <td>dateformat</td><td>Y-m-d H:i:s</td><td>Das in NagVis benutzte Format f&uuml;r Datum- und Zeit. Verf&uuml;gbare Optionen wie bei der <a href="http://www.php.net/date">date()</a>-Funktion von php     </td><td> 
        </tr>
        <tr>
            <td><strike>displayheader</strike></td><td><strike>1</strike></td><td><strike>Anzeigen des Header-Menus in Maps</strike><font color="#ff0000"> Veraltet ab Version 1.4, siehe Option "headermenu" in den default- und index-Abschnitten</font></td>
        </tr>
        <tr>
            <td>language</td><td>en_US</td><td>W&auml;hlen Sie die Sprache, die in NagVis benutzt werden soll. <code>de_DE</code> (Deutsch), <code>en_US</code> (Englisch), <code>fr_FR</code> (Franz&ouml;sisch) und <code>pt_BR</code> (brasilianisches Portugiesisch; ab 1.4.4) sind als Standard verf&uuml;gbar). Seit 1.4 m&uuml;ssen Sie die Sprache in einem anderen Format angeben. (&quot;de_DE&quot; statt &quot;german&quot;)</td>
        </tr>
        <tr>
            <td>language_available</td><td>de_DE,en_US,es_ES,fr_FR,pt_BR</td><td>Sie m&ouml;chten Ihren Benutzern vielleicht eine Auswahl an verschiedenen Sprachen anbieten. Sie k&ouml;nnen das Verhalten kontrollieren, ohne die Sprachdateien aus Ihrer NagVis-Installation zu l&ouml;schen. Wenn dieser Wert nicht gef&uuml;llt ist, werden alle vorkonfigurierten Sprachen angeboten. Wenn Sie eine weitere Sprache hinzuf&uuml;gen m&ouml;chten, dann m&uuml;ssen Sie den Wert hier eintragen</td>
        </tr>
        <tr>
            <td>language_detection</td><td>user,session,browser,config</td><td>Dies kontrolliert, wie NagVis die Sprache des Benutzers ermitteln soll. NagVis kennt mehrere Mechanismen zur Erkennung der Sprache:<br>
            <i>- user:</i> explizit vom Benutzer eingestellte Sprache<br>
            <i>- session:</i> wenn der Benutzer eine Sprache w&auml;hlt, dann wird diese in der Session gespeichert<br>
            <i>- browser:</i> NagVis versucht, die Sprache mit Hilfe des Browser-Agenten zu ermitteln<br>
            <i>- config:</i> die Default-Sprache der Installation<br>
            Die Reihenfolge der Optionen bestimmt die Reihenfolge, in der NagVis die verschiedenen Mechanismen benutzt
            </td>
        </tr>
        <tr>
            <td>logonmodule</td><td>LogonMixed</td><td>Definiert das zu benutzende Logon-Modul. Per Default benutzt NagVis das Mixed-Auth-Modul, das dem Benutzernamen vertraut, der per REMOTE_USER oder dem HTML-Logon-Dialog zur Abfrage von Authentifizierungsinformationen &uuml;bergeben wurde, falls REMOTE_USER nicht gesetzt ist.
            <p>Bei der Auslieferung sind die folgenden Module verf&uuml;gbar:</p>

            <p><i>LogonMixed</i>: Das gemischte Logon-Modul benutzt das LogonEnv-Modul als Standard und das LogonDialog-Modul als Ausweichl&ouml;sung, falls LogonEnv keinen Benutzernamen zur&uuml;ckliefert. Das sollte den Anforderungen in den meisten Umgebungen gen&uuml;gen.</p>

            <p><i>LogonDialog</i>: Dies ist ein HTML-Anmeldedialog, um die Authentifizierungsinformationen abzufragen.</p>

            <p><i>LogonEnv</i>: Es ist m&ouml;glich, einen vollst&auml;ndig zu "trauendem" Authentifizierungsmechanismus wie in den Vorg&auml;ngerversionen von NagVis zu realisieren. Auf diese Weise wird der Benutzer nicht wirklich authentifiziert.
            NagVis vertraut dem gelieferten Benutzernamen implizit. NagVis benutzt die konfigurierte Umgebungsvariable, um den Benutzer zu identifizieren. Sie k&ouml;nnen Ihrem Webserver verschiedene Authentifizierungsmechanismen hinzuf&uuml;gen, angefangen mit der Basic-Authentifizierung, die von Nagios genutzt wird (.htaccess) bis hin zu Single-Sign-On-Umgebungen.<br> 
            Setzen Sie einfach logonmodule auf "LogonEnv", setzen Sie die als Benutzername zu verwendende Umgebungsvariable auf die Option logonenvvar und teilen Sie dem Authentifizierungsmodul mit, dass Benutzer in der Datenbank neu anzulegen sind, wenn der gelieferte Benutzer noch nicht vorhanden ist. Die Option logonenvcreaterole weist das Authentifizierungsmodul an, den neuen Benutzer einer Rolle zuzuweisen. Setzen Sie die Option auf einen leeren String, um dieses Verhalten auszuschalten.</p>
   
            <p><i>LogonMultisite</i>: Dieses Modul benutzt die Authentifizierung von auth_*-Cookies, die von Check_MK-Multisite geliefert werden, wenn die Cookie-basierte Authentifizierung verwendet wird.</p>

            <p>Es ist m&ouml;glich, eigene Logon-Module hinzuzuf&uuml;gen, um andere Dialoge zu bedienen. Weitere Informantionen finden Sie in der <a href="logon_modules.html">logon module</a>-Dokumentation.</p></td>

        </tr>
        <tr>
            <td>logonenvvar</td><td>REMOTE_USER</td><td>Definiert die Umgebungsvariable, die f&uuml;r das Holen des authentifizierten Benutzers aus der Webserver-Umgebung benutzt werden soll. Diese Option wird nur f&uuml;r die Logon-Module LogonEnv und LogonMixed verwendet.</td>
        </tr>
        <tr>
            <td>logonenvcreateuser</td><td>1</td><td>Veranlasst das LogonEnv/LogonMixedModul, ein Benutzerkonto f&uuml;r jeden unbekannten Benutzer anzulegen, der die NagVis-Seite &ouml;ffnet. Diese Option wird nur f&uuml;r die Logon-Module LogonEnv und LogonMixed verwendet.</td>
        </tr>
        <tr>
            <td>logonenvcreaterole</td><td>Guests</td><td>Veranlasst das LogonEnv/LogonMixedModul, die Benutzerkonten mit der angegebenen Rolle anzulegen. Diese Option wird nur f&uuml;r die Logon-Module LogonEnv und LogonMixed verwendet.</td>
        </tr>
        <tr>
            <td>logon_multisite_htpasswd</td>
            <td></td>
            <td>Der Pfad zur htpasswd-Datei, die von Multisite benutzt wird (wird nur vom LogonMultisite-Modul verwendet).</td>
        </tr>
        <tr>
            <td>logon_multisite_secret</td>
            <td></td>
            <td>Der Pfad zur auth-secret-Datei, die von Multisite benutzt wird (wird nur vom LogonMultisite-Modul verwendet).</td>
        </tr>
        <tr>
            <td>logon_multisite_createuser</td>
            <td>1</td>
            <td>Gleich wie die &quot;logonenvcreateuser&quot;-Option (wird nur vom LogonMultisite-Modul verwendet).</td>
        </tr>
        <tr>
            <td>logon_multisite_createrole</td>
            <td>Guest</td>
            <td>Gleich wie die &quot;logonenvcreaterole&quot;-Option (wird nur vom LogonMultisite-Modul verwendet).</td>
        </tr>
        <tr>
            <td>refreshtime</td><td>60</td><td>Aktualisierungsintervall in Maps bzw. laden der n&auml;chsten Map bei Map-Rotation</td>
        </tr>
        <tr>
            <td>sesscookiedomain</td><td>automatisch ermittelt</td><td>Vielleicht m&ouml;chten Sie festlegen, f&uuml;r welche Domain NagVis das Session-Cookie speichern soll. Per Default versucht NagVis, den Wert mit Hilfe der Web-Server-Umgebungsvariablen selbst zu ermitteln. Dies sollte in den meisten Umgebungen funktionieren, k&ouml;nnte sich aber z.B. durch URL-Rewriting &auml;ndern.</td>
        </tr>
        <tr>
            <td>sesscookiepath</td><td>automatisch ermittelt</td><td>Vielleicht m&ouml;chten Sie den Pfad festlegen, f&uuml;r den NagVis das Session-Cookie speichern soll. Per Default versucht NagVis, den Wert mit Hilfe der paths/htmlbase-Variablen selbst zu ermitteln. Dies sollte in den meisten Umgebungen funktionieren, k&ouml;nnte sich aber z.B. durch URL-Rewriting &auml;ndern.</td>
        </tr>
        <tr>
            <td>sesscookieduration</td><td>86400</td><td> Lebensdauer des Cookies in Sekunden. Der Standardwert ist auf 24 Stunden eingestellt. Das NagVis-Session-Cookie wird bei jedem Seitenaufruf erneuert. Wenn eine Session länger als die eingestellte Zeit unt&auml;tig ist, wird sie ung&uuml;ltig.</td>
        </tr>
        <tr>
            <td>startmodule</td><td>overview</td><td>Das anzuzeigende Startmodul, wenn vom Benutzer keins angegeben wird.</td>
        </tr>
        <tr>
            <td>startaction</td><td>view</td><td>Die Default-Aktion, wenn vom Benutzer keine angegeben wird.</td>
        </tr>
        <tr>
        <td>startshow</td><td></td>
        <td>
            Der startshow-Parameter wird zur Zeit nur von einigen Views benutzt.
            Er wird von den Map- und AutoMap-Modulen verwendet.</td>
        </tr>
    </table>
    
    <a name="paths"></a>
    <h3>paths</h3>
    In diesem Abschnitt werden alle ben&ouml;tigten Pfad-Variablen definiert. <br>
    <!--Dieses Beispiel zeigt alle Werte des paths-Abschnitts: <br>
    <pre>[paths]
    base="/usr/local/nagvis/share/"
    htmlbase="/nagvis"
    htmlcgi="/nagvis/cgi-bin"</pre>
    --> 
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>base</td><td><code>/usr/local/nagvis/share/</code></td><td>absoluter physikalischer NagVis-Pfad</td>
        </tr>
        <tr>
            <td>htmlbase</td><td><code>/nagvis</code></td><td>absoluter html-NagVis-Pfad</td>
        </tr>
        <tr>
            <td>htmlcgi</td><td><code>/nagvis/cgi-bin</code></td><td>absoluter html-NagVis-cgi-Pfad</td>
        </tr>
    </table>
    
    <a name=defaults></a>
    <h3>defaults</h3>
    Default-Werte f&uuml;r Maps, die Sie benutzen. Wenn f&uuml;r die Map bzw. ein Element kein Wert angegeben wurde, dann wird ein Standardwert benutzt. <br>
    <!--Dieses Beispiel zeigt alle Werte im defaults-Abschnitt: <br>
    <pre>[defaults]
    backend="ndomy_1"
    icons="std_medium"
    recognizeservices=1
    onlyhardstates=0
    backgroundcolor="#ffffff"
    headertemplate="default"
    showinlists=1
    urltarget="_self"
    hovermenu=1
    hovertemplate="default"
    hoverdelay=0
    hoverchildshow=1
    hoverchildssort="a"
    hoverchildsorder="asc"
    hoverchildslimit=10
    </pre>
    -->
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>backend</td><td>live_1</td><td>Default-Backend (ID des Backends - kopieren Sie den Text, der f&uuml;r <code>&lt;backend-id></code> steht, nach <code>[backend_&lt;backend-id>]</code>)</td>
        </tr>
        <tr>
            <td>backgroundcolor</td><td>transparent</td><td>Default-Hintergrundfarbe f&uuml;r Maps</td>
        </tr>
        <tr>
            <td>contextmenu</td><td>0</td><td>Aktivieren/Deaktivieren des Kontextmen&uuml;s auf Ihren Map-Objekten.</td>
        </tr>
        <tr>
            <td>contexttemplate</td><td>default</td><td>Default <a href="context_templates.html">context template</a>.</td>
        </tr>
        <tr>
            <td> eventbackground     </td><td> 0 </td><td> aktivieren (1) bzw. deaktivieren (0) des Wechselns der Hintergrundfarbe bei Status&auml;nderungen (die konfigurierte Farbe wird gezeigt, wenn der Gesamtstatus PENDING, OK oder UP ist)</td>
        </tr>
        <tr>
            <td> eventhighlight     </td><td> 1 </td><td> aktivieren (1) bzw. deaktivieren (0) der Hervorhebung von Status&auml;nderungen durch Hinzuf&uuml;gen einer blinkenden Umrandung</td>
        </tr>
        <tr>
            <td> eventhighlightduration     </td><td> 10000 </td><td> Dauer der Hervorhebung in Millisekunden</td>
        </tr>
        <tr>
            <td> eventhighlightinterval     </td><td> 500 </td><td> Intervall der Hervorhebung in Millisekunden</td>
        </tr>
        <tr>
            <td> eventlog     </td><td> 0 </td><td> aktivieren (1) bzw. deaktivieren (0) des Ereignisprotokolls im neuen JavaScript-Frontend. Das Ereignisprotokoll enth&auml;lt wichtige Aktionen und Informationen</td>
        </tr>
        <tr>
            <td>eventlogevents</td><td>24</td><td>Anzahl von Ereignissen im Ereignisprotokoll-Rückblick</td>
        </tr>
        <tr>
            <td> eventloglevel     </td><td> info </td><td> Loglevel des Ereignisprotokolls (verf&uuml;gbar: debug, info, warning, critical)</td>
        </tr>
        <tr>
            <td> eventheight     </td><td> 100 </td><td> H&ouml;he des JavaScript-Eventlogs in Pixeln</td>
        </tr>
        <tr>
            <td> eventhidden     </td><td> 1 </td><td> Verstecken/Zeigen des Eventlogs w&auml;hrend des Map-Ladens</td>
        </tr>
        <tr>
            <td> eventscroll     </td><td> 1 </td><td> aktivieren (1) bzw. deaktivieren (0) des Bewegens zu dem Icon, das den Status ver&auml;ndert hat, falls das Icon nicht im sichtbaren Bereich liegt</td>
        </tr>
        <tr>
            <td> eventsound     </td><td> 1 </td><td> aktivieren (1) bzw. deaktivieren (0) von Sound-Signalen bei Status&auml;nderungen</td>
        </tr>
        <tr>
            <td> headerfade     </td><td> 0 </td><td>aktivieren/deaktivieren des Abblendeffekts in den Untermen&uuml;s des Header-Men&uuml;s (wenn das verwendete Header-Men&uuml; diese Option unterst&uuml;tzt).</td>
        </tr>
        <tr>
            <td>headermenu</td><td>1</td><td>aktivieren (1) bzw. deaktivieren (0) des Headermen&uuml;s</a></td>
        </tr>
        <tr>
            <td>headertemplate</td><td>default</td><td>Default <a href=./header_templates.html#header/templates">header template</a></td>
        </tr>
        <tr>
            <td>hoverchildslimit</td><td>10</td><td>max. Anzahl von Child-Objekten     </td>
        </tr>
        <tr>
            <td>hoverchildsorder</td><td>asc</td><td>Reihenfolge von Child-Objekten ("asc"=aufsteigend, "desc"=absteigend)     </td>
        </tr>
        <tr>
            <td>hoverchildsshow</td><td>1</td><td>Anzeigen von Child-Objekten in Hover-Men&uuml;s     </td>
        </tr>
        <tr>
            <td>hoverchildssort</td><td>a</td><td>Sortierreihenfolge von Child-Objekten ("s"=Status, "a"=Alphabet)     </td>
        </tr>
        <tr>
            <td>hoverdelay</td><td>0</td><td>Verz&ouml;gerung des Hover-Men&uuml;-Auftretens (in Sekunden)</td>
        </tr>
        <tr>
            <td>hovermenu</td><td>1</td><td>aktivieren/deaktivieren von Hover-Men&uuml;s     </td>
        </tr>
        <tr>
            <td>hovertemplate</td><td>default</td><td>Default <a href=./hover_templates.html#hover/templates>hover template</a></td>
        </tr>
        <tr>
            <td><strike>hovertimeout</strike></td><td><strike>5</strike></td><td><strike>Default-Timeout bei Ajax-Anfragen in Hover-Men&uuml;s (in Sekunden)</strike> <font color=#ff0000>veraltet ab 1.4</font>     </td>
        </tr>
        <tr>
            <td>icons     </td><td>std_medium </td><td>Default-Iconset</td>
        </tr>
        <tr>
            <td>onlyhardstates</td><td>0</td><td>nur Hard-Zust&auml;nde benutzen (keine Soft-Zust&auml;nde)</td>
        </tr>
        <tr>
            <td>recognizeservices</td><td>1</td><td>Service-Zust&auml;nde in Host/Hostgroup-Objekten erkennen</td>
        </tr>
        <tr>
            <td>showinlists</td><td>1</td><td>Anzeigen von Maps in Listen (Dropdowns, Index-Seite, ...)</td>
        </tr>
        <tr>
        <td> showinmultisite </td><td> 1 </td><td> Anzeigen der Maps im Multisite-Snapin</td>
        </tr>
        <tr>
            <td>stylesheet</td><td></td><td>Dateiname des benutzerdefinierten Stylesheets, das in den Maps verwendet werden soll. Die Datei muss im share/nagvis/styles-Verzeichnis abgelegt werden.</td>
        </tr>
        <tr>
            <td>urltarget</td><td>_self</td><td>Ziel des Icon-Links, diese Option passt &lt;a target=""> an (_self ist das gleiche Fenster)</td>
        </tr>
        <tr>
            <td>hosturl</td><td>[htmlcgi]/status.cgi?host=[host_name]</td><td>Die Default-URL, die bei einem Links-Klicks des Benutzers auf ein Host-Objekt benutzt wird. Verf&uuml;gbare Makros: [htmlcgi], [htmlbase], [host_name], [backend_id]</td>
        </tr>
        <tr>
            <td>hostgroupurl</td>
            <td>[htmlcgi]/status.cgi?hostgroup=[hostgroup_name]</td>
            <td>Die Default-URL, die bei einem Links-Klicks des Benutzers auf ein Hostgruppen-Objekt benutzt wird.
        Verf&uuml;gbare Makros: [htmlcgi], [htmlbase], [hostgroup_name], [backend_id]</td>
        </tr>
        <tr>
            <td>serviceurl</td>
            <td>[htmlcgi]/extinfo.cgi?type=2&host=[host_name]&service=[service_description]</td>
            <td>Die Default-URL, die bei einem Links-Klicks des Benutzers auf ein Service-Objekt benutzt wird.
        Verf&uuml;gbare Makros: [htmlcgi], [htmlbase], [host_name], [service_description], [backend_id]</td>
        </tr>
        <tr>
            <td>servicegroupurl</td>
            <td>[htmlcgi]/status.cgi?servicegroup=[servicegroup_name]</td>
            <td>Die Default-URL, die bei einem Links-Klicks des Benutzers auf ein Servicegruppen-Objekt benutzt wird.
        Verf&uuml;gbare Makros: [htmlcgi], [htmlbase], [servicegroup_name], [backend_id]</td>
        </tr>
        <tr>
            <td>mapurl</td>
            <td>[htmlbase]/index.php?mod=Map&act=view&show=[map_name]</td>
            <td>Die Default-URL, die bei einem Links-Klicks des Benutzers auf ein Map-Objekt benutzt wird.
        Verf&uuml;gbare Makros: [htmlcgi], [htmlbase], [map_name]</td>
        </tr>
        <tr>
            <td>view_template</td>
            <td>default</td>
            <td>In den verschiedenen Views zu benutzendes Template.</td>
        </tr>
        </table>
    
    <a name="index"></a>
    <h3>index</h3>
    Dieses sind die Optionen f&uuml;r die &Uuml;bersichtsseite von NagVis. <br>
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>backgroundcolor</td><td>#ffffff</td><td>Default-Hintergrundfarbe f&uuml;r die &Uuml;bersichtsseite</td>
        </tr>
        <tr>
            <td>cellsperrow</td><td>4</td><td>Maps pro Zeile in Map-Listen.</td>
        </tr>
        <tr>
            <td>headermenu</td><td>1</td><td>aktivieren (1) bzw. deaktivieren (0) des Headermen&uuml;s</a></td>
        </tr>
        <tr>
            <td>headertemplate</td><td>default</td><td>Default <a href=./header_templates.html#header/templates">header template</a></td>
        </tr>
        <tr>
            <td>showautomaps</td><td>1</td><td>aktivieren/deaktivieren der Anzeige von Automaps</td>
        </tr>
        <tr>
            <td>showmaps</td><td>1</td><td>aktivieren/deaktivieren der Anzeige von Maps</td>
        </tr>
        <tr>
            <td>showmapthumbs</td><td>1</td><td>aktivieren/deaktivieren der Anzeige von Map-Thumbnails</td>
        </tr>
        <tr>
            <td>showrotations</td><td>1</td><td>aktivieren/deaktivieren der Anzeige von definierten Rotationen</td>
        </tr>
    </table>
    
    <a name="automap"></a>
    <h3>automap</h3>
    Setzt die Automap-Optionen.
    <!--
    <pre>[automap]
    showinlists=1
    defaultroot="localhost"
    graphvizpath="/usr/local/bin"
    defaultparams="&childLayers=2"</pre>
    -->
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>defaultparams</td><td>&childLayers=2</td><td>Dies sind die Parameter f&uuml;r die Automap-Ansichten und Links in den Listen (Map-Indexseite, Dropdown-Men&uuml;s in den Headern)</td>
        </tr>
        <tr>
            <td>defaultroot</td><td>localhost</td><td>Default-Wert f&uuml;r das Root-Objekt. Details finden Sie in der <a href=./automap.html>Automap-Dokumentation</a></td>
        </tr>
        <tr>
            <td>graphvizpath</td><td>/usr/local/bin</td><td>wenn die graphviz-Binaries (dot,neato,twopi,...) nicht &uuml;ber PATH gefunden werden k&ouml;nnen, muss der Pfad hier gesetzt werden</td>
        </tr>
        <tr>
            <td>showinlists</td><td>1</td><td>aktivieren/deaktivieren der Automap in Map-Listen (Map-Indexseite, Dropdown-Men&uuml;s in den Headern)</td>
        </tr>
    </table>
    
    <a name="wui"></a>
    <h3>wui</h3>
    Dieses sind die Optionen f&uuml;r die WUI. <br>
    <!--Dieses Beispiel zeigt alle Werte des wui-Abschnitts: <br>
    <pre>[wui]
    autoupdatefreq=25
    maplocktime=5
    allowedforconfig=EVERYONE</pre>
    --> 
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td><strike>autoupdatefreq</strike></td><td>25</td><td>In diesem Intervall wird die Map von der WUI gesichert (<font color="red">veraltet ab 1.6</font>).</td>
        </tr>
        <tr>
            <td>grid_color</td><td>#f7f7f7</td><td>Die Farbe der Rasterlinien.</td>
        </tr>
        <tr>
            <td>grid_show</td><td>0</td><td>Aktivieren (1) bzw. deaktivieren (0) eines Rasters, um die Ausrichtung von Objekten im WUI zu vereinfachen. Objekte werden an der linken, oberen Ecke ausgerichtet.</td>
        </tr>
        <tr>
            <td>grid_steps</td><td>32</td><td>Gr&ouml;&szlig;e des Rasters in Pixeln.</td>
        </tr>
        <tr>
            <td><strike>headermenu</strike></td><td>1</td><td>Aktivieren (1) bzw. deaktivieren (0) des Header-Men&uuml;s im WUI (<font color="red">veraltet ab 1.6</font>).</td>
        </tr>
        <tr>
            <td><strike>headertemplate</strike></td><td>default</td><td>zu benutzendes Standard-<a href="header_templates">Header-Template</a> im WUI (<font color="red">veraltet ab 1.5</font>).</td>
        </tr>
        <tr>
            <td>maplocktime</td><td>5</td><td>Zeit in Minuten, die eine Map von einem editierenden Benutzer blockiert wird.</td>
        </tr>
    </table>
    
    <a name="worker"></a>
    <h3> worker </h3>
    Optionen f&uuml;r den neuen Worker im JavaScript-Frontend von NagVis.
    <table style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td> interval     </td><td> 5 </td><td> Das Intervall in Sekunden, in dem der Worker auf zu aktualisierende Objekte pr&uuml;ft. </td>
        </tr>
        <tr>
            <td> requestmaxlength     </td><td> 1900 </td><td> Die maximale L&auml;nge von HTTP-Requests w&auml;hrend Ajax-HTTP-Requests. Einige Intrusion Detection/Prevention-Systeme haben ein Problem mit zu langen Queries. </td>
        </tr>
        <tr>
            <td> requestmaxparams     </td><td> 0 </td><td> Die maximale Anzahl von Parametern in Ajax-HTTP-Requests. Einige Intrusion Detection/Prevention-Systeme haben Probleme mit zu vielen Parametern im URL. 0 = keine Begrenzung. </td>
        </tr>
        <tr>
            <td> updateobjectstates     </td><td> 15 </td><td> Die Aufbewahrungszeit in Sekunden f&uuml;r die Zust&auml;nde im Frontend. Die Statusinformationen werden nach Ablauf dieser Zeit im folgenden Worker-Intervall aufgefrischt. </td>
        </tr>
    </table>
    
    <a name="backend"></a>
    <h3>backend_*</h3>
    Die Backend-Abschnitte zur Definition der Backends werden alle <code>[backend_&lt;backend-id>]</code> benannt. In dem Beispiel ist <code>live_1</code> die <code>backend_id</code>. <br><br>
    Abh&auml;ngig vom Wert in backendtype m&uuml;ssen die g&uuml;ltigen Werte f&uuml;r die Backends gesetzt werden. In diesem Beispiel ist es das MKLivestatus-Backend. <br>
    <pre>[backend_live_1]
    backendtype="mklivestatus"
    htmlcgi="/nagios/cgi-bin"
    ; the following options depend on the selected backendtype, in this case it is MKLivestatus
    socket="unix:/usr/local/nagios/var/rw/live</pre>
    
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>backendtype</td><td>mklivestatus</td><td>Art des Backends - MUSS gesetzt werden</td>
        </tr>
        <tr>
            <td>statushost</td><td>&nbsp;</td>
            <td><p>Der "statushost" kann genutzt werden, um l&auml;stige Timeouts zu vermeiden, wenn ein Backend nicht erreichbar ist. Dies ist nur sinnvoll in Multi-Backend-Umgebungen.</p>
            <p>Es funktioniert wie folgt: Die Annahme ist, dass es ein "lokales" Backend gibt, das den Host des "entfernten" Backends &uuml;berwacht.
            Wenn der entfernte Backend-Host als "UP" gemeldet wird, dann wird das Backend ganz normal abgefragt.</p>
            <p>Wenn der entfernte Backend-Host als "DOWN" oder "UNREACHABLE" gemeldet wird, dann wird NagVis solange keine Verbindung dorthin versuchen, bis der Backend-Host wieder verf&uuml;gbar ist.</p>
            <p>Der "statushost" muss im folgenden Format angegeben werdent: &quot;&lt;backend_id>:&lt;hostname>&quot;
            -> e.g. &quot;live_2:nagios&quot;</p>
            <p>Der Host muss in einem anderen Backend sein als der aktuelle, damit es funktioniert.</p>
        </td>
        </tr>
        <tr>
            <td>htmlcgi</td><td>/nagios/cgi-bin</td><td>Pfad zum cgi-bin-Verzeichnis dieses Backends (wichtig bei mehreren Backends)</td>
        </tr>
        <tr>
            <td>custom_1</td><td></td><td>Erste benutzerdefinierte Variable, die in den Context- und Hover-Men&uuml;s verf&uuml;gbar ist. Mit dieser Option k&ouml;nnen verschiedene benutzerdefinierte URLs zu den Context-/Hover-Men&uuml;s hinzugef&uuml;gt werden, die jeweils vom Backend abh&auml;ngig sind. Das ist u.a. nutzbar, wenn Links auf verschiedene Nagios-Instanzen hinzugef&uuml;gt werden sollen.</td>
        </tr>
        <tr>
            <td>custom_2</td><td></td><td>Zweite benutzerdefinierte Variable (s.o).<td>
        </tr>
        <tr>
            <td>custom_3</td><td></td><td>Dritte benutzerdefinierte Variable (s.o).<td>
        </tr>
    </table>
    <p>Die Backend-spezifischen Optionen finden Sie in der <a href="backends.html">Backend-Dokumentation</a>.</p>
    
    <a name="rotation"></a>
    <h3>rotation_*</h3>
    Definiert verschiedene Map-Rotationspools. In diesem Beispiel schaltet der Browser alle 15 Sekunden zwischen den Maps "demo" und "demo2" hin und her. Die Rotation wird aktiviert durch die URL: index.php?rotation=&lt;rotation-id>.
    In diesem Fall ist die Rotation-ID "demo" <br>
    <pre>[rotation_demo]
    maps="demo,demo2"
    interval=15</pre>
    
    <table border=0 style="width:100%">
        <tr>
            <th width="200">Wert</th><th width="150">Default</th><th>Beschreibung</th>
        </tr>
        <tr>
            <td>interval</td><td>15</td><td>Map-Rotationsintervall in Sekunden     </td>
        </tr>
        <tr>
            <td>maps</td><td>     </td>
            <td>
                kommaseparierte Liste von Maps in diesem Pool, die zu rotieren sind. Sie k&ouml;nnen auch externe URLs durch [ ] klammern (z.B. maps="demo1,[http://localhost/test.php]". Die URL muss von dem Server erreichbar sein, auf dem NagVis l&auml;uft.<br><br> 
                Sie k&ouml;nnen Label im folgenden Format hinzuf&uuml;gen: &lt;label&gt;:&lt;map&gt; und &lt;label&gt;:&lt;[url]&gt;. Die Label werden in der Rotationsliste angezeigt.<br><br>
                Es ist au&szlig;erdem m&ouml;glich, Automaps zu Rotationen hinzuzuf&uuml;gen. Setzen Sie einfach ein "@"-Zeichen vor den Name der Automap, um sie der Rotation hinzuzuf&uuml;gen.
            </td>
        </tr>
    </table>
    
    <a name="states"></a>
    <h3>states</h3>
    <p>Optionen, die die Behandlung und das Aussehen der verschiedenen Zust&auml;nde in der NagVis-Installation beeinflussen.</p>
    <p>Diese Einstellungen definieren das Verhalten der Zustandsbehandlung. Haupts&auml;chlich ist es m&ouml;glich zu konfigurieren, welcher Zustand einen anderen "&uuml;berdeckt". Ein kritischer Zustand (5) wird eine Warnung (4) &uuml;berdecken, ein best&auml;tigter kritischer Zustand (2) wird nicht eine Warnung (4) &uuml;berdecken.</p>

    <table>
        <tr> <th style="width:200px">Wert</th><th style="width:150px">Default</th></tr>
        <tr> <td>unreachable</td><td>8</td>     </tr>
        <tr> <td>unreachable_ack</td><td>5</td>     </tr>
        <tr> <td>unreachable_downtime</td>><td>5</td>     </tr>
        <tr> <td>down</td><td>7</td>     </tr>
        <tr> <td>down_ack</td><td>5</td>     </tr>
        <tr> <td>down_downtime</td><td>5</td>     </tr>
        <tr> <td>critical</td><td>7</td>     </tr>
        <tr> <td>critical_ack</td><td>5</td>     </tr>
        <tr> <td>critical_downtime</td><td>5</td>     </tr>
        <tr> <td>warning</td><td>6</td>     </tr>
        <tr> <td>warning_ack</td><td>4</td>     </tr>
        <tr> <td>warning_downtime</td><td>4</td>     </tr>
        <tr> <td>unknown</td><td>3</td>     </tr>
        <tr> <td>unknown_ack</td><td>2</td>     </tr>
        <tr> <td>unknown_downtime</td><td>2</td>     </tr>
        <tr> <td>error</td><td>3</td>     </tr>
        <tr> <td>error_ack</td><td>2</td>     </tr>
        <tr> <td>error_downtime</td><td>2</td>     </tr>
        <tr> <td>ok</td><td>1</td>     </tr>
        <tr> <td>up</td><td>1</td>     </tr>    
        <tr><td>unchecked <font color="#ff0000">(neu in 1.6)</font></td><td>0</td></tr>
        <tr> <td>pending</td><td>0</td>     </tr>
    </table>
    
    <p>Diese Einstellungen definieren das Verhalten der Zust&auml;nde im Frontend.
    <ul>
        <li><b>*_bgcolor:</b> Die bgcolor-Option wird als Hintergrundfarbe bei Eventhandlern benutzt.</li>
        <li><b>*_color:</b> Sie k&ouml;nnen die Vordergrundfarben konfigurieren, die u.a. als Linienfarben und der Hervorhebung von Eventhandlern benutzt werden.</li>
        <li><b>*_sound:</b> Die Sound-Dateien werden bei &Auml;nderungen in den genannten Zustand abgespielt (muss MP3-Format sein).</li>
    </ul>
    
    <table>
        <tr><th style="width:270px">Value</th><th style="width:150px">Default</th></tr>
        <tr><td>unreachable_bgcolor</td><td>#F1811B</td></tr>
        <tr><td>unreachable_color</td><td>#F1811B</td></tr>
        <tr><td>unreachable_ack_bgcolor</td><td></td></tr>
        <tr><td>unreachable_downtime_bgcolor</td><td></td></tr>
        <tr><td>unreachable_sound</td><td>std_unreachable.mp3</td></tr>
        <tr><td>down_bgcolor</td><td>#FF0000</td></tr>
        <tr><td>down_color</td><td>#FF0000</td></tr>
        <tr><td>down_ack_bgcolor</td><td></td></tr>
        <tr><td>down_downtime_bgcolor</td><td></td></tr>
        <tr><td>down_sound</td><td>std_down.mp3</td></tr>
        <tr><td>critical_bgcolor</td><td>#FF0000</td></tr>
        <tr><td>critical_color</td><td>#FF0000</td></tr>
        <tr><td>critical_ack_bgcolor</td><td></td></tr>
        <tr><td>critical_downtime_bgcolor</td><td></td></tr>
        <tr><td>critical_sound</td><td>std_critical.mp3</td></tr>
        <tr><td>warning_bgcolor</td><td>#FFFF00</td></tr>
        <tr><td>warning_color</td><td>#FFFF00</td></tr>
        <tr><td>warning_ack_bgcolor</td><td></td></tr>
        <tr><td>warning_downtime_bgcolor</td><td></td></tr>
        <tr><td>warning_sound</td><td>std_warning.mp3</td></tr>
        <tr><td>unknown_bgcolor</td><td>#FFCC66</td></tr>
        <tr><td>unknown_color</td><td>#FFCC66</td></tr>
        <tr><td>unknown_ack_bgcolor</td><td></td></tr>
        <tr><td>unknown_downtime_bgcolor</td><td></td></tr>
        <tr><td>unknown_sound</td><td></td></tr>
        <tr><td>error_bgcolor</td><td>#0000FF</td></tr>
        <tr><td>error_color</td><td>#0000FF</td></tr>
        <tr><td>error_ack_bgcolor</td><td></td></tr>
        <tr><td>error_downtime_bgcolor</td><td></td></tr>
        <tr><td>error_sound</td><td></td></tr>
        <tr><td>ok_bgcolor</td><td>#00FF00</td></tr>
        <tr><td>ok_color</td><td>#00FF00</td></tr>
        <tr><td>ok</td><td></td></tr>
        <tr><td>up_bgcolor</td><td>#00FF00</td></tr>
        <tr><td>up_color</td><td>#00FF00</td></tr>
        <tr><td>up_sound</td><td></td></tr>
        <tr><td>unchecked_bgcolor <font color="#ff0000">(neu in 1.6)</font></td><td>#C0C0C0</td></tr>
        <tr><td>unchecked_color <font color="#ff0000">(neu in 1.6)</font></td><td>#C0C0C0</td></tr>
        <tr><td>unchecked_sound <font color="#ff0000">(neu in 1.6)</font></td><td></td></tr>
        <tr><td>pending_bgcolor</td><td>#C0C0C0</td></tr>
        <tr><td>pending_color</td><td>#C0C0C0</td></tr>
        <tr><td>pending_sound</td><td></td></tr>
        </table>
    
</html>
